# 예제1-11 원소 선택

In [1]:
import pandas as pd

### DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장

In [2]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}

In [3]:
df = pd.DataFrame(exam_data)

### '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영

In [4]:
df.set_index('이름', inplace = True)
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### df의 특정 원소 1개 선택('서준'의 '음악' 점수)

In [5]:
a = df.loc['서준','음악']
print(a)

85

In [6]:
b = df.iloc[0, 2]
print(b)

85

a와 b 동일함을 알 수 있다.

### df의 특정 원소 2개 이상 선택('서준'의 '음악', '체육' 점수)

In [7]:
c = df.loc['서준',['음악', '체육']]
print(c)

음악     85
체육    100
Name: 서준, dtype: int64

In [8]:
d = df.iloc[0, [2, 3]]
print(d)

음악     85
체육    100
Name: 서준, dtype: int64

In [9]:
e = df.loc['서준', '음악':'체육']
print(e)

음악     85
체육    100
Name: 서준, dtype: int64

In [10]:
f = df.iloc[0, 2:]
print(e)

음악     85
체육    100
Name: 서준, dtype: int64

c, d, e, f 모두 같은 결과 값을 출력한다.

### df 2개 이상의 행과 열에 속하는 원소들 선택<br>('서준', '우현'의 '음악', '체육' 점수)

In [14]:
g = df.loc[['서준', '우현'], ['음악', '체육']]
print(g)

    음악   체육
이름
서준  85  100
우현  95   90

In [15]:
h = df.iloc[[0, 1], [2, 3]]
print(h)

    음악   체육
이름
서준  85  100
우현  95   90

In [16]:
i = df.loc['서준':'우현', '음악':'체육']
print(i)

    음악   체육
이름
서준  85  100
우현  95   90

In [17]:
j = df.iloc[0:2, 2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90

g, h, i, j 모두 같은 결과 값을 출력한다.

# 예제 1-12 열 추가

In [18]:
import pandas as pd

### DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장

In [19]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)

In [23]:
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

### df에 '국어' 점수 열 추가, 데이터 값은 80 지정

In [24]:
df['국어'] = 80; df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

# 예제 1-13 행 추가

In [25]:
import pandas as pd

### DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장

In [26]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data); df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

### 새로운 행 추가 - 같은 원소 값 입력

In [27]:
df.loc[3] = 0
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

### 새로운 행 추가 - 원소 값 여러 개의 배열 입력

In [28]:
df.loc[4] = ['동규', 90, 80, 70, 60]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

### 새로운 행 추가 - 기존 행 복사

In [29]:
df.loc[5] = df.loc[3]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60
5   0   0   0    0    0

# 예제 1-14 원소 값 변경

In [30]:
import pandas as pd

### DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장

In [31]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data); df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

### '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영

In [32]:
df.set_index('이름', inplace = True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수

In [33]:
df.iloc[0][3] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

###

In [35]:
df.iloc[0, 3] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [36]:
df.loc['서준']['체육'] = 90
df

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [37]:
df.loc['서준','체육'] = 100
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

### df의 원소 여러 개를 변경하는 방법: '서준'의 '음악', '체육' 점수

In [38]:
df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [39]:
df.loc['서준',['음악','체육']] = 100, 50
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

# 예제 1-15 행, 열 바꾸기

In [40]:
import pandas as pd

### DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장

In [41]:
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90, 80, 70],
            '영어': [98, 89, 95],
            '음악': [85, 95, 100],
            '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data); df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

### df를 전치하기(메소드 활용)

In [42]:
df = df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

### df를 다시 전치하기(클래스 속성 활용)

In [43]:
df = df.T
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90